{
  "540d9b79-1a4a-44b0-a779-2c1a53804b67": {
    "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
    "_ownerName": "Leanne Philip",
    "content": "When it comes to exploring the great outdoors, it doesn’t get more epic than the Grand Canyon. A favorite with both experienced campers and beginners (my people!), this famed national park features breathtaking views, quaint stores, and historic sites—all socially distanced to the max. Keep reading for my must-see spots for the perfect summer adventure!",
    "_blogId": "3987279d-0ad4-4afb-8ca9-5b256ae3b298",
    "_createdOn": 1614260681375
  },
  "c79fd494-648c-4da7-8f55-af60e8370d06": {
    "_ownerId": "ac0a911f-7032-4f32-95b4-1b2ecf8afcf9",
    "_ownerName": "Chris M",
    "content": "Going to be out that way next week and have a day or two to see the Grand Canyon (first time) but... my problem is... we were planning on west rim as its closer to Las Vegas (where we'll be staying) but accommodations don't seem readily available... if I'm going to have to drive an hour past the west rim for a hotel... shouldn't we just go to the north or south rim instead... any advice would be greatly appreciated... dont wanna spend a ton of money but regular budget hotel for a night possibly two nights... we'll be driving to Los Angeles after that for a few days as well",
    "_blogId": "3987279d-0ad4-4afb-8ca9-5b256ae3b298",
    "_createdOn": 1614262681371
  },
  "901a3444-6c35-45fd-9d8e-9607787fd1e1": {
    "_ownerId": "2c280eee-5233-4cb1-930a-59d863b19151",
    "_ownerName": "LovemyAcura",
    "content": "The west rim is a tourist rip off where they nickel and dime you for everything. Go to the north or south rim for a true GC np experience. South rim there is more to do - both rims amazing views.",
    "_blogId": "3987279d-0ad4-4afb-8ca9-5b256ae3b298",
    "_createdOn": 1614260681273
  },
  "a0241493-b95c-4e3f-b7ad-885ef759efd9": {
    "_ownerId": "7a391e46-2a36-4cbc-92eb-95009e197449",
    "_ownerName": "PapawGotaGoPro",
    "content": "I just uploaded a YouTube video of my recent experience going through Terminal 3. Full footage of the shark tank.",
    "_blogId": "1a0ef8a5-371d-40fe-9a53-0a68527b9b3c",
    "_createdOn": 1614260681375
  },
  "d419d986-db59-4c1c-b2e9-5b3282798cf7": {
    "_ownerId": "dc794573-cfbc-4fed-b823-9e42faa731b7",
    "_ownerName": "Lauren Dana Ellman",
    "content": "If you’re anything like me, chances are you’re always on the hunt for the best eats, stays, and activities in a particular locale, including popular tourist-heavy spots. Just take the Riviera Maya, for example.",
    "_blogId": "1a0ef8a5-371d-40fe-9a53-0a68527b9b3c",
    "_createdOn": 1614262681371
  },
  "1ade029b-443e-4401-9a4d-9a012c46502f": {
    "_ownerId": "3a568954-2375-44af-a1bc-ad490fd9342b",
    "_ownerName": "Shea Peters",
    "content": "These days, I’m all about working remotely, and luckily, all I need is decent wi-fi and a laptop. One of my go-to destinations away from home is the Riviera Maya—the beaches are beautiful, the locals super friendly, and there are direct flights into Cancun from almost everywhere in the US. So here’s my guide to the area if you want an easy escape.",
    "_blogId": "1a0ef8a5-371d-40fe-9a53-0a68527b9b3c",
    "_createdOn": 1614260681273
  },
  "1e94516e-4879-47db-b6b0-7c5594e76405": {
    "_ownerId": "5a6d1152-fbb5-4966-a316-5c35c1e8a55c",
    "_ownerName": "Jess J",
    "content": "Stunning! You cannot conceptualise how much water and power is in the falls unless you have seen it first hand. I went in March 2023 and the weather was still extremely cold with the odd flutter of snow. The water volume is reduced due to the water freezing, however the power is still amazing.",
    "_blogId": "35f08930-d99f-436f-b6ce-505e1b1aae7b",
    "_createdOn": 1614260681375
  },
  "76017303-5ce0-4aa7-829a-6db7bd9ad17d": {
    "_ownerId": "5e943dbd-eb2a-4329-9617-92663920de7e",
    "_ownerName": "f15t15",
    "content": "Very beautiful and unbelievable falls,You have to buy tickets and then you should put on a plastic cover then you will get on a big boats and the boats will take you near the waterfalls,I think It's a very good experience.",
    "_blogId": "35f08930-d99f-436f-b6ce-505e1b1aae7b",
    "_createdOn": 1614262681371
  },
  "05680398-0cbe-4672-9c75-4535959c7060": {
    "_ownerId": "2fc4f565-9731-4b8e-b8d7-033264bfe2ad",
    "_ownerName": "Syeda Romana Khalid",
    "content": "One of the main highlights of Niagara Falls is, of course, the waterfall itself. The sheer size and power of the falls are awe-inspiring, and you can witness it from several different viewpoints. Some popular spots to view the falls include the Skylon Tower, the Niagara SkyWheel, and the Niagara Falls State Park.",
    "_blogId": "35f08930-d99f-436f-b6ce-505e1b1aae7b",
    "_createdOn": 1614260681273
  },
  "d329cfd2-4249-4a8b-8ac0-24ccca49a11c": {
    "_ownerId": "c1f24657-0189-4e86-97c2-d9803f282b83",
    "_ownerName": "Wat Arun",
    "content": "So many different buildings and courtyards to explore - plus the giant golden Buddha! Many different explanatory signs, easy to wander around and soak it in. The different styles of architecture and design on each building were particularly impressive! Also a great mix of tourists and worshippers/locals.",
    "_blogId": "725ff76b-d535-4ed7-b60c-0cdb7dde8da6",
    "_createdOn": 1614260681375
  },
  "806985f5-82e6-442b-84a4-4947c0b7b6a5": {
    "_ownerId": "05062751-57cc-42ec-a254-552837cd3d8e",
    "_ownerName": "Thomas E",
    "content": "A short walk from the palace, thru old Bangkok you get to the mount.A circular walk up it to the summit, which also has great views over the town. At night it’s lit up to highlight the gold. Worth going.",
    "_blogId": "725ff76b-d535-4ed7-b60c-0cdb7dde8da6",
    "_createdOn": 1614262681371
  },
  "b04d2760-7543-49b7-b922-65fc2a6c8f8d": {
    "_ownerId": "764c2a88-226a-40ae-9d4e-ecf25411374d",
    "_ownerName": "Margaret B",
    "content": "Beautiful, big park in the center of the city. A pleasant surprise in the midst of the crowded streets. It even has a public library in the middle of it.",
    "_blogId": "725ff76b-d535-4ed7-b60c-0cdb7dde8da6",
    "_createdOn": 1614260681273
  },
  "a2b01853-0254-4e9c-80da-9a48862c4d7d": {
    "_ownerId": "03ed045a-5eb1-43ac-8b88-c516d21a696d",
    "_ownerName": "kerryytheng",
    "content": "As usual one of the main tourist attractions with the same prefecture that everyone check in , nice environment and still recommended for check in and photo taking",
    "_blogId": "3bfbd7fc-aad4-4c18-b9be-407ee2ba50fe",
    "_createdOn": 1614260681375
  },
  "98aab9d4-68a3-46c9-be9a-77ca7e8dc33b": {
    "_ownerId": "e4e38b78-c755-4036-ad04-a8972ad3f662",
    "_ownerName": "daftpuff",
    "content": "We thought that coming here early on a weekday, in November, would be less crowded... but NOPE. Super crowded. I guess you gotta come here before sunrise, but I bet even then it'd be full of photographers. It's quite a dilemma because by going we're also contributing to the crowds! I'm gonna skip this entirely next time.",
    "_blogId": "3bfbd7fc-aad4-4c18-b9be-407ee2ba50fe",
    "_createdOn": 1614262681371
  },
  "c7b590f6-2859-4682-a095-aefedfdcdba3": {
    "_ownerId": "7821bf2a-0a5c-41fd-9eb5-00d376ea4e09",
    "_ownerName": "Steve L",
    "content": "Highly recommended day trip when visiting Kyoto. Explore the bamboo grove, natural landscape (mountains, river, forest) and many ancient temples. The area is a popular destination for Japanese and tourist alike so get there early. Highly recommend the monkey park on the other side of the bridge. Many great places to shop for gifts to bring home. Easy to get there on the JR from Kyoto station.",
    "_blogId": "3bfbd7fc-aad4-4c18-b9be-407ee2ba50fe",
    "_createdOn": 1614260681273
  },
  "4ec62446-ba85-4ece-83f8-8d3a82a629a1": {
    "_ownerId": "84805e36-4b8c-4336-8354-673951e1d117",
    "_ownerName": "Peter A",
    "content": "Well worth a visit! Slightly surreal but fascinating garden area which really comes alive at night. Stay for the free light show at 8.45 pm",
    "_blogId": "81e98ca8-b06a-4892-a04c-e33dda924abc",
    "_createdOn": 1614260681375
  },
  "595813bd-6fe7-4c58-b0cc-f8b974e66d61": {
    "_ownerId": "1ff72f75-44b8-49b7-9218-16b7c7ff9ef7",
    "_ownerName": "HeatSeeker",
    "content": "Stunning, so much more than orchids, a must see attraction. As well as orchids there are plenty of gingers, carnivorous plants, bromeliads, and lots more. We really loved the new improved cool house. Amazing range of orchids. It does feel really cold as you get to the lower part. There are only very limited options to sit and rest in the cool house. Enjoy a quick visit and see lots of orchids, or linger for an hour and find lots more, including orchids with tiny flowers, a few as small as a grain of rice.",
    "_blogId": "81e98ca8-b06a-4892-a04c-e33dda924abc",
    "_createdOn": 1614262681371
  },
  "d0d700e5-6c6c-461a-9a67-9056fda77fce": {
    "_ownerId": "dcee5ddb-59d4-45ff-98ab-55c4c87980e9",
    "_ownerName": "Graham C",
    "content": "Among the most imaginative urban parks in the world. the artificial trees are a wonder. MRT now goes right there. Would be nice if there were more sophisticated places to eat, but the street food is excellent.",
    "_blogId": "81e98ca8-b06a-4892-a04c-e33dda924abc",
    "_createdOn": 1614260681273
  },
  "3a98c702-32bd-4252-ac82-a7e7e9841a36": {
    "_ownerId": "d6c21f79-95d7-494f-8a2d-49ff4416a441",
    "_ownerName": "Emma D",
    "content": "Picturesque area - the cathedral. Lots of pretty lanes with bespoke boutique shops, bars, cafes and restaurants. Reminded me a bit of parts of Kotor to be honest. Nice for a chilled afternoon stroll.",
    "_blogId": "e8f9b82b-daf8-4d65-baa6-4ec7fec9a4f0",
    "_createdOn": 1614260681375
  },
  "d583b6b8-33e5-4b96-ab99-a065ae6f545c": {
    "_ownerId": "3941c18a-3afb-4a9d-8209-f0fafe5e30ef",
    "_ownerName": "Fremaux A",
    "content": "Park Güell is a must-see attraction in Barcelona! It's a stunning masterpiece of architecture and nature, designed by the genius Antoni Gaudí. You'll be amazed by the colorful mosaic tiles, whimsical buildings, and panoramic views of the city. Don't miss this magical place!",
    "_blogId": "e8f9b82b-daf8-4d65-baa6-4ec7fec9a4f0",
    "_createdOn": 1614262681371
  },
  "5578eb30-3fc8-4c13-b217-e67aeb08e975": {
    "_ownerId": "d27fa863-b59c-4442-a8c7-a1d9d254b6f6",
    "_ownerName": "Wayne Ng",
    "content": "We spent 5 days in Barcelona. It was an amazing place. All travelling resorts are located in the city centre. You can easily get there by metro or even on foot. There are a lot of impressive sightseeing places, such as Sagrada Familia, Park Güell, Casa Mila. Someone may worry the safety. But I felt quite safe there. The people are also quite nice and helpful. I highly recommend to visit there.",
    "_blogId": "e8f9b82b-daf8-4d65-baa6-4ec7fec9a4f0",
    "_createdOn": 1614260681273
  },
  "9a139191-6e6b-4e91-b77a-1d1a2382f060": {
    "_ownerId": "59a2670a-7c0d-4a8f-843c-98c9e971413c",
    "_ownerName": "Karen S",
    "content": "WOW WOW WOW, this is a must. In hindsigh, I wish I'd gone with the tour guide, mainly because they really captured my imagination when I listened to them talking to their tour group. Really, really busy after midday, so it's better to go early if you can. Book your tickets to, for fast track, as you'll spend hours in the queues. Underground looks good, but to be fair, you can see better from the arena down into the underground. ",
    "_blogId": "3ff5e943-e2a4-4bc8-ad81-3dba3745b3b2",
    "_createdOn": 1614260681375
  },
  "f5c6e789-ee64-4756-84c5-4ec32b14a007": {
    "_ownerId": "c18a1e22-fb6e-4c7e-9474-2c0046df5fe4",
    "_ownerName": "Adewale",
    "content": "One of the many famous landmarks in Rome. Pantheon is ever-bubbly, with multiple restaurants, shops, an ice cream spot etc all around it. The interior of the church building it houses is also beautiful. Definitely must-see place.",
    "_blogId": "3ff5e943-e2a4-4bc8-ad81-3dba3745b3b2",
    "_createdOn": 1614262681371
  },
  "6ddd5994-6541-433d-b1b9-d3fc00956b8a": {
    "_ownerId": "4b3afd40-cfa6-4fa0-825f-312e34cba342",
    "_ownerName": "Kathy M",
    "content": "This world famous fountain lives up to its reputation, in particular after dark when the lighting of the white marble and blue and silver of the water is spectacular. Obviously it is almost always crowded, but you can usually manage to get to the water to throw in your coin. Warning, it is drained each morning to recover the coins, so don’t go then.",
    "_blogId": "3ff5e943-e2a4-4bc8-ad81-3dba3745b3b2",
    "_createdOn": 1614260681273
  },
  "30aeec49-da95-49ab-9aee-94488eae9a33": {
    "_ownerId": "56b84497-1b0b-4c2d-bd19-bc595b62223d",
    "_ownerName": "Emile",
    "content": "During my last stay in France, in Paris in the capital, I had to visit the Musée d'Orsay. It is an art museum in Paris and is very rich in arts, with pretty paintings, statues, sculptures. The museum has an orchestra and a restaurant. My visit to this museum was enriching for me in particular on works of arts and I can only advise to visit it if possible because it is very enriching on the knowledge of the arts and this museum has a large collection.",
    "_blogId": "084bce75-3888-4905-aaf0-0b1d2546b062",
    "_createdOn": 1614260681375
  },
  "1e8aa7ec-071a-4d1d-86cb-cc7d0861db1a": {
    "_ownerId": "ad076635-e8b4-4c8f-a2fc-98896e71c599",
    "_ownerName": "Josh K",
    "content": "Paris is a great place to go out with your spouse or significant other. I went with my wife and we had a great time. One of the most romantic places you will encounter in your life.",
    "_blogId": "084bce75-3888-4905-aaf0-0b1d2546b062",
    "_createdOn": 1614262681371
  },
  "9bfdce89-e0ec-4f5b-bc61-1b9bc5025508": {
    "_ownerId": "ba6027c6-3e81-4c78-8672-c82b4018b21b",
    "_ownerName": "Nik S",
    "content": "This is a must-see in Paris! Had the Mona Lisa along with other amazing works of art and sculptures. Entry was fast and efficient with a reservation. Overall, visiting the Louvre Museum is an amazing experience.",
    "_blogId": "084bce75-3888-4905-aaf0-0b1d2546b062",
    "_createdOn": 1614260681273
  },
  "a4179309-0d1b-412d-a719-d5dc9512d320": {
    "_ownerId": "4af7ee33-f81a-4db0-9950-244370bb971e",
    "_ownerName": "Ghada S",
    "content": "Extensive collection of some of the most important objects on display in Egypt. Definitely worth a visit on even the tightest tour schedule. Great to combine with a visit to the National Museum of Egyptian Civilization to see the actual mummies.",
    "_blogId": "a4760425-e7d2-47aa-a77b-bd1f43c6128e",
    "_createdOn": 1614260681375
  },
  "f4bafd96-f26b-435e-b145-63e120437cec": {
    "_ownerId": "f0b75dfc-c73d-4cd4-9537-3a5668dad78c",
    "_ownerName": "fozjon",
    "content": "This is definitely a lovely area to walk around and explore. It would have been nice if we had time to linger, I think. But there are many old churches here and some significant \"holy\" sites.",
    "_blogId": "a4760425-e7d2-47aa-a77b-bd1f43c6128e",
    "_createdOn": 1614262681371
  },
  "9a0c1b77-368c-4225-819c-cec7bb3d7c7c": {
    "_ownerId": "7fe29a2c-c14a-49c1-b2e0-f6e263c1f0c0",
    "_ownerName": "PennStateProud",
    "content": "A must-see for anyone visiting Cairo. This structure provides one of the best views of Cairo and is steeped in historical value. The architecture, both inside and outside, is breathtaking.",
    "_blogId": "a4760425-e7d2-47aa-a77b-bd1f43c6128e",
    "_createdOn": 1614260681273
  },
  "03d0e329-15cf-4b9c-b3ed-d886ddeee699": {
    "_ownerId": "045011a1-6ca8-469c-89e4-75f5558d62e3",
    "_ownerName": "selen2019",
    "content": "We had an amazing day with my dad in Ras Mohammed! National Park itself and the coral were amazing, but having Ahmed as a guide was also our chance! He made our day much more better with his guidance in area&snorkeling and smiling face! He is polite, caring and friendly. He also made a strawberry juice for us, and the food was also so tasty in the camping area! Also he provided all the equipment including a wetsuit for snorkeling. I loved the reefs, Anemone City, Yolanda, Sharks Reef. I saw the best view in my whole life in Anemone City, wow, I am so impressed by this place!",
    "_blogId": "237d75ad-53e4-4414-9e95-7d477af60e6d",
    "_createdOn": 1614260681375
  },
  "233b3c8c-ccaf-4227-9e6a-d1f684db48ef": {
    "_ownerId": "2e7b8f75-2751-494e-9ce1-b4c534c91a77",
    "_ownerName": "Alkosary O",
    "content": "If you're looking for a beautiful and unique place to spend some enjoyable time, don't miss out on visiting \"Soho Square\"! Located in the heart of the city, this place includes many wonderful shops, restaurants, and cafes, as well as various entertainment activities and events suitable for all ages",
    "_blogId": "237d75ad-53e4-4414-9e95-7d477af60e6d",
    "_createdOn": 1614262681371
  },
  "f8481157-020c-426a-89b7-44a8f879d7bd": {
    "_ownerId": "f9e07931-14b1-4292-b8f1-29286795c912",
    "_ownerName": "Yehia C",
    "content": "Visiting this church will give you some background of the area well build. Greatly appreciated. I recommended ",
    "_blogId": "237d75ad-53e4-4414-9e95-7d477af60e6d",
    "_createdOn": 1614260681273
  },
  "f4abdba1-a793-4cf4-ad20-f3b450566505": {
    "_ownerId": "31691a96-7a5e-4925-ba21-a804e25d6741",
    "_ownerName": "Ed Longley",
    "content": "A very interesting place to visit, however without a guide, I’m not sure how much you’ll learn or take away from the experience.",
    "_blogId": "4d7ca8d3-06ea-41da-85a6-b34e703f6515",
    "_createdOn": 1614260681375
  },
  "374e19ae-2a79-4f9c-815d-e1b21f61fedb": {
    "_ownerId": "51c6622a-7215-4db2-88ee-4e0b0f2a35bc",
    "_ownerName": "adrenalinejunkie007",
    "content": "Vising the jardin was a nice break from the busyness of our stay in Marrakech. It does get crowded and we did have to wait in line to purchase access so plan accordingly. The garden hosts a variety of plants and fruits, and is well-maintained. We enjoyed the exhibits on the Berber groups, which I found to be the most educational on the topic during my stay in Morocco. There's definitely photo ops if you're into that, but since it's pretty touristy make sure to allow time for that. After our visit we had some tea in the cafe within the place before continuing our itinerary, which I felt was a nice end to the viist.",
    "_blogId": "4d7ca8d3-06ea-41da-85a6-b34e703f6515",
    "_createdOn": 1614262681371
  },
  "47d859cc-fedd-4269-b116-b9bdb5fa3a5a": {
    "_ownerId": "4765639d-9b09-4a50-a62e-d1296b9028d8",
    "_ownerName": "Eszter S",
    "content": "Exploring the souks in the medina is an amazing way to experience some of Marrakesh. The sellers are friendly, non-pushy, and there’s a world of things to buy. The moped fumes can get a bit much, but apart from that, set aside some time to get lost, and enjoy!",
    "_blogId": "4d7ca8d3-06ea-41da-85a6-b34e703f6515",
    "_createdOn": 1614260681273
  }
}
